window.NM = window.NM || {};
NM.DB = NM.DB || {};
NM.DB.map = {
  width:6000, height:6000,
  grid:{ margin:200, step:400, road:60 },
  playerStart:{x:3000,y:3000},
  interactRadius:360,
  parkCells:[[2,2],[9,9],[5,12],[12,4],[3,8]],
  waterCells:[[0,12],[1,12],[0,11],[12,0],[13,0],[0,13],[13,13]],
  plazaCells:[[6,6],[7,6],[6,7],[7,7]],
  districts:[
    {name:'ЦЕНТР',          x:3000, y:3000},
    {name:'ПРОМЗОНА',       x:5000, y:1400},
    {name:'ПОРТ',           x:1200, y:5000},
    {name:'СПАЛЬНЫЙ РАЙОН', x:1600, y:1200},
    {name:'БИЗНЕС-ЦЕНТР',   x:4600, y:4200},
    {name:'АЭРОПОРТ',       x:5200, y:5200},
    {name:'СТАРЫЙ ГОРОД',   x:2600, y:4600},
    {name:'НАБЕРЕЖНАЯ',     x:700,  y:3000},
    {name:'УНИВЕРСИТЕТ',    x:3800, y:1600},
    {name:'РЫНОК',          x:2200, y:2600}
  ]
};
